{
  "timestamp": "2025-08-22T23:33:07.686371",
  "trigger_event": "Standup",
  "standup_update": "```json\n{\n  \"Alex\": {\n    \"PROJ-101\": {\n      \"status\": \"In Progress\",\n      \"summary\": \"Alex has finished the entire user dashboard layout and the responsive design. He is planning to add the data visualization components and start connecting to the mock API. He also plans to work on the user profile section.\"\n    },\n    \"PROJ-105\": {\n      \"status\": \"In Progress\",\n      \"summary\": \"Alex is ready to connect the frontend dashboard to the real API endpoints as soon as they are available.\"\n    },\n    \"PROJ-107\": {\n      \"status\": \"To Do\",\n      \"summary\": \"Alex will be fixing validation message display issues on mobile devices once the current tasks are complete.\"\n    }\n  },\n  \"Jordan\": {\n    \"PROJ-102\": {\n      \"status\": \"In Progress\",\n      \"summary\": \"Jordan has completed the registration and login APIs, including all the validation logic. He is working on user profile management endpoints and the password reset functionality today. He plans to deploy to staging this afternoon.\"\n    },\n    \"PROJ-108\": {\n      \"status\": \"In Progress\",\n      \"summary\": \"Jordan will continue to work on improving and updating the API documentation once the authentication system is further along.\"\n    }\n  },\n  \"Sam\": {\n    \"PROJ-103\": {\n      \"status\": \"In Progress\",\n      \"summary\": \"Sam has set up the testing framework and ran initial tests on the registration endpoint. He has found a few minor issues with validation. He plans to run the full test suite once Jordan deploys, and prepare tests for Alex's frontend integration.\"\n    }\n  },\n  \"Taylor\": {\n    \"PROJ-104\": {\n      \"status\": \"In Progress\",\n      \"summary\": \"Taylor has integrated automated testing into the pipeline and configured environment variables. She plans to optimize Docker images to reduce build times and set up monitoring today.\"\n    },\n    \"PROJ-106\": {\n      \"status\": \"In Progress\",\n      \"summary\": \"Taylor is waiting on production access to configure production AWS environment.\"\n    }\n  },\n  \"blockers\": {\n    \"Taylor\": \"Taylor is waiting for production access to AWS.\"\n  }\n}\n```"
}